[
  {
    "link": "https://apnews.com/article/zelenskyy-security-guarantees-trump-meeting-washington-eebdf97b663c2cdc9e51fa346b09591d",
    "title": "Zelenskyy leaves White House without signing minerals deal after Oval Office blowup",
    "snippet": "WASHINGTON (AP) — President Donald Trump berated Ukrainian President Volodymyr Zelenskyy for being “disrespectful” Friday in an extraordinary Oval Office...",
    "date": "1 day ago",
    "source": "AP News"
  },
  {
    "link": "https://www.npr.org/2025/03/01/nx-s1-5313883/trump-english-official-language-executive-order",
    "title": "Trump signs executive order making English the official language of the U.S.",
    "snippet": "President Trump has signed an executive order designating English as the official language of the U.S., the first such designation in the country's history.",
    "date": "1 hour ago",
    "source": "NPR"
  },
  {
    "link": "https://www.bbc.com/news/articles/cnvz566n523o",
    "title": "Most Republicans laud Trump after Zelensky showdown, but some express dismay",
    "snippet": "Most Republicans have backed US President Donald Trump and Vice-President JD Vance following their public row in the Oval Office with Ukrainian President...",
    "date": "3 hours ago",
    "source": "BBC"
  },
  {
    "link": "https://www.nbcnews.com/politics/trump-administration/aclu-sues-trump-administration-halt-immigrant-transfers-guantanamo-rcna194358",
    "title": "ACLU sues Trump administration to halt immigrant transfers to Guantanamo",
    "snippet": "Immigrant rights groups sued the Trump administration on Saturday in hopes of stopping the transfer of migrants from the U.S. to Guantanamo Bay.",
    "date": "3 hours ago",
    "source": "NBC News"
  },
  {
    "link": "https://www.washingtonpost.com/politics/2025/03/01/cuomo-adams-new-york-trump/",
    "title": "In New York, a mayor’s race takes shape that’s all about Donald Trump",
    "snippet": "Former New York governor Andrew Cuomo, who famously challenged Trump during the covid-19 pandemic, is running to replace embattled New York Mayor Eric...",
    "date": "4 minutes ago",
    "source": "The Washington Post"
  },
  {
    "link": "https://www.cnn.com/2025/03/01/europe/zelensky-trump-support-ukraine-intl/index.html",
    "title": "Zelensky says Trump’s backing is ‘crucial’ after US president berated him at White House",
    "snippet": "Ukraine's President Volodymyr Zelensky says US support is “crucial” a day after leaving the country early following an extraordinary public argument with...",
    "date": "1 hour ago",
    "source": "CNN"
  },
  {
    "link": "https://www.nytimes.com/athletic/6168060/2025/03/01/donald-trump-pete-rose-pardon/",
    "title": "Donald Trump says he will posthumously pardon MLB hit king Pete Rose - The Athletic",
    "snippet": "President Donald Trump said Friday that he will posthumously pardon Pete Rose, the disgraced Cincinnati Reds star who received a lifetime ban from baseball...",
    "date": "6 hours ago",
    "source": "The New York Times"
  },
  {
    "link": "https://theorcasonian.com/guest-opinion-in-acrimonious-meeting-trump-berates-zelensky/",
    "title": "Guest Opinion | Donald Trump, Elon Musk and the Muskrats: A Personal View",
    "snippet": "The president should try being as kind to America's friend as he is to Putin ||| FROM MICHAEL RIORDAN ||| I WILL NEVER FORGET my first and only encounter.",
    "date": "1 hour ago",
    "source": "theOrcasonian.com"
  },
  {
    "link": "https://www.theguardian.com/us-news/2025/mar/01/media-politicians-react-trump-zelenskyy",
    "title": "‘Bewildering’: US media and politicians react to Trump’s televised attack on Zelenskyy",
    "snippet": "The showdown between the US president and the Ukrainian leader dumbfounded various outlets and politicos.",
    "date": "5 hours ago",
    "source": "The Guardian"
  },
  {
    "link": "https://www.democratandchronicle.com/story/news/2025/02/28/donald-trump-approval-ratings-what-the-latest-polls-say/80669210007/",
    "title": "Donald Trump’s approval ratings: Here’s what the latest polls say",
    "snippet": "Polls are coming in just over a month after President Donald Trump was sworn into office, providing insight into Americans' opinions on his administration...",
    "date": "6 hours ago",
    "source": "Democrat and Chronicle"
  }
]