[
  {
    "link": "https://elpais.com/america-colombia/2025-03-01/gustavo-petro-anuncia-a-julian-molina-como-nuevo-ministro-de-las-tic.html",
    "title": "Gustavo Petro anuncia a Julián Molina como nuevo ministro de las TIC",
    "snippet": "El presidente de Colombia, Gustavo Petro, ha anunciado este sábado que Julián Molina es el nuevo ministro de las Tecnologías de la Información y las...",
    "date": "hace 4 horas",
    "source": "EL PAÍS"
  },
  {
    "link": "https://www.infobae.com/colombia/2025/03/01/jorge-robledo-responsabilizo-a-gustavo-petro-de-la-crisis-por-el-agua-en-bogota-esto-explico/",
    "title": "Jorge Robledo responsabilizó a Gustavo Petro de la crisis por el agua en Bogotá: esto explicó",
    "snippet": "El exsenador Jorge Enrique Robledo aseguró que durante la administración de Gustavo Petro en Bogotá se detuvo un importante proyecto en relación con el...",
    "date": "hace 6 horas",
    "source": "Infobae"
  },
  {
    "link": "https://www.eltiempo.com/politica/gobierno/asi-va-la-agenda-del-presidente-gustavo-petro-en-uruguay-3431541",
    "title": "Así va la agenda del presidente Gustavo Petro en Uruguay",
    "snippet": "El mandatario llegó en la noche del viernes y estará en la posesión de Yamandú Orsi este sábado. El presidente Gustavo Petro junto con sus homólogos Yamandú...",
    "date": "hace 11 horas",
    "source": "ELTIEMPO.COM"
  },
  {
    "link": "https://www.elespectador.com/politica/gustavo-petro-asi-se-rearma-para-la-recta-final-de-su-gobierno-nuevos-ministros-y-peleas-en-el-gabinete-noticias-hoy/",
    "title": "Fuego amigo y ajustes: así se rearma Petro para el epílogo de su administración",
    "snippet": "Tras casi un mes del polémico consejo de ministros televisado que implosionó al gabinete de Gobierno, el presidente Gustavo Petro tiene ocho caras nuevas en...",
    "date": "hace 4 horas",
    "source": "El Espectador"
  },
  {
    "link": "http://www.elcolombiano.com/colombia/presidente-gustavo-petro-anuncio-julian-molina-como-nuevo-ministro-de-las-tic-MH26741094",
    "title": "Presidente Gustavo Petro anunció a Julián Molina como nuevo ministro de las TIC",
    "snippet": "Por medio de un escueto mensaje a través de su cuenta de X, el presidente Gustavo Petro nombró este sábado a Julián Ruperto Molina Gómez, como el próx...",
    "date": "hace 8 horas",
    "source": "El Colombiano"
  },
  {
    "link": "https://www.presidencia.gov.co/prensa/Paginas/Gustavo-Petro-asistira-a-la-posesion-presidencial-de-Yamandu-Orsi-en-Urugua-250228.aspx",
    "title": "Gustavo Petro asistirá a la posesión presidencial de Yamandú Orsi en Uruguay y cumplirá agenda bilateral en la región",
    "snippet": "El presidente de Colombia, Gustavo Petro Urrego, llegó en la noche del viernes a Montevideo para participar en la ceremonia de transmisión de mando...",
    "date": "hace 1 día",
    "source": "presidencia.gov.co"
  },
  {
    "link": "https://www.rcnradio.com/colombia/gustavo-petro-anuncia-nuevo-ministro-de-las-tic-para-su-gabinete",
    "title": "Gustavo Petro anuncia nuevo Ministro de las TIC para su gabinete",
    "snippet": "Este sábado en la mañana, el presidente Gustavo Petro anunció nuevo Ministro de las TIC, en reemplazo de Mauricio Lizcano.",
    "date": "hace 9 horas",
    "source": "RCN Radio"
  },
  {
    "link": "https://www.semana.com/confidenciales/articulo/andres-petro-hijo-del-presidente-gustavo-petro-se-caso-en-canada/202529/",
    "title": "Andrés Petro, hijo del presidente Gustavo Petro, se casó en Canadá",
    "snippet": "En marzo de 2024, Andrés Petro le pidió matrimonio a su novia Maira González y así quedó evidenciado en su momento en las redes sociales de la pareja.",
    "date": "hace 2 horas",
    "source": "Semana.com"
  },
  {
    "link": "https://www.infobae.com/colombia/2025/03/01/gustavo-petro-revela-el-nombre-del-nuevo-ministro-de-las-tecnologias-de-la-informacion-y-comunicaciones/",
    "title": "Gustavo Petro revela el nombre del nuevo ministro de las Tecnologías de la Información y Comunicaciones: este es Julian Ruperto Molina",
    "snippet": "El presidente Gustavo Petro anunció el nombramiento a través de redes sociales. Con este paso, el gobierno busca impulsar la transformación digital y...",
    "date": "hace 8 horas",
    "source": "Infobae"
  },
  {
    "link": "https://www.eltiempo.com/politica/gobierno/presidente-petro-anuncia-nuevo-ministro-de-las-tic-sera-julian-molina-3431559",
    "title": "Presidente Petro anuncia nuevo ministro de las TIC: será Julián Molina",
    "snippet": "El presidente Gustavo Petro anunció el que será el nuevo ministro de las TIC, se trata de Julián Ruperto Molina, que era uno de los que figuraba como...",
    "date": "hace 9 horas",
    "source": "ELTIEMPO.COM"
  },
  {
    "link": "https://elpais.com/america-colombia/2025-03-01/petro-renueva-su-gabinete-para-acelerar-los-resultados-en-el-tramo-final-de-su-mandato.html",
    "title": "Petro renueva su Gabinete para acelerar los resultados en el tramo final de su mandato",
    "snippet": "Tres largas semanas de crisis política en Colombia están a punto de llegar a su fin, según el propio presidente. Gustavo Petro realizó el jueves una suerte...",
    "date": "hace 22 horas",
    "source": "EL PAÍS"
  },
  {
    "link": "https://www.rcnradio.com/politica/el-exvicepresidente-german-vargas-lleras-critico-al-gobierno-de-petro",
    "title": "El exvicepresidente, Germán Vargas Lleras, criticó al gobierno de Petro",
    "snippet": "El exvicepresidente Germán Vargas Lleras lanzó fuertes críticas contra el gobierno del presidente Gustavo Petro.",
    "date": "hace 6 horas",
    "source": "RCN Radio"
  },
  {
    "link": "https://www.infobae.com/colombia/2025/03/02/la-boda-secreta-del-hijo-de-petro-se-caso-en-canada-sin-la-presencia-del-presidente/",
    "title": "La boda secreta del hijo de Petro: se casó en Canadá sin la presencia del presidente",
    "snippet": "El hijo del presidente Gustavo Petro, Andrés Petro, celebró su matrimonio con su pareja, Maira González, en una discreta ceremonia realizada el sábado 1 de...",
    "date": "hace 58 minutos",
    "source": "Infobae"
  },
  {
    "link": "https://elpais.com/america-colombia/2025-03-01/la-nueva-apuesta-del-presidente-petro.html",
    "title": "La nueva apuesta del presidente Petro",
    "snippet": "En respuesta a la crisis política que enfrenta su gobierno, el presidente colombiano hace un nuevo intento por reorganizar su equipo y mantener cerca a sus...",
    "date": "hace 22 horas",
    "source": "EL PAÍS"
  },
  {
    "link": "https://www.infobae.com/colombia/2025/03/01/maria-fernanda-cabal-se-despacho-contra-petro-por-afirmar-que-no-subsidiara-a-las-universidades-privadas-ignorancia-o-maldad/",
    "title": "María Fernanda Cabal se despachó contra Petro por afirmar que no subsidiará a las universidades privadas: “Ignorancia o maldad”",
    "snippet": "En la entrega de la nueva sede de la Universidad del Valle en Suárez, Cauca, llevada a cabo el 28 de febrero de 2025, el presidente Gustavo Petro se refirió...",
    "date": "hace 3 horas",
    "source": "Infobae"
  }
]