[
  {
    "link": "https://apnews.com/article/russia-ukraine-war-zelenskyy-starmer-trump-b025877c40ffe0ddf2a92adad1715231",
    "title": "Ukraine’s Zelenskyy says end of war with Russia is ‘very, very far away’",
    "snippet": "Ukrainian President Volodymyr Zelenskyy says a deal to end the war between Ukraine and Russia “is still very, very far away.\"",
    "date": "20 hours ago",
    "source": "AP News"
  },
  {
    "link": "https://www.cnn.com/politics/live-news/trump-congress-address-03-04-25/index.html",
    "title": "Trump to lay out domestic and foreign policy agenda in address to Congress",
    "snippet": "President Donald Trump will deliver an address to a joint session of Congress on Tuesday as he forges ahead with enacting his domestic and foreign policy...",
    "date": "LIVE1 hour ago",
    "source": "CNN"
  },
  {
    "link": "https://www.npr.org/sections/planet-money/2025/03/04/g-s1-51515/trump-asserting-extraordinary-power-over-independent-agencies-is-the-fed-next",
    "title": "Trump is asserting extraordinary power over independent agencies. Is the Fed next? : Planet Money",
    "snippet": "This first appeared in the Planet Money newsletter. You can sign up here. President Trump vs. the independent agencies. It's a battle for the history books...",
    "date": "2 hours ago",
    "source": "NPR"
  },
  {
    "link": "https://www.aljazeera.com/news/liveblog/2025/3/4/trump-live-us-pauses-all-military-aid-to-ukraine-after-zelenskyy-clash",
    "title": "Trump live: US pauses aid to Ukraine, puts tariffs on Canada, Mexico, China",
    "snippet": "US President Donald Trump is pausing all military aid for Ukraine after a disastrous Oval Office meeting with his Ukrainian counterpart, Volodymyr Zelenskyy...",
    "date": "LIVE6 minutes ago",
    "source": "Al Jazeera"
  },
  {
    "link": "https://www.reuters.com/world/europe/trump-halts-all-us-military-aid-ukraine-white-house-official-says-2025-03-04/",
    "title": "Ukraine can hold out on frontline, Kyiv says after Trump's military aid pause",
    "snippet": "Ukraine said its forces could hold their own on the battlefield after Trump paused military aid to Kyiv in the most dramatic step yet in his pivot towards...",
    "date": "31 minutes ago",
    "source": "Reuters"
  },
  {
    "link": "https://www.nbcnews.com/politics/white-house/trump-joint-address-congress-what-to-expect-rcna194476",
    "title": "What to expect from Trump's prime time address before Congress",
    "snippet": "President Donald Trump on Tuesday night will deliver a joint address to Congress, where he is expected to lay out his efforts to rapidly slash the size of...",
    "date": "2 hours ago",
    "source": "NBC News"
  },
  {
    "link": "https://abcnews.go.com/Politics/trump-address-congress-nation-tests-limits-presidential-power/story?id=119395178",
    "title": "Trump to address Congress and nation as he tests limits of presidential power",
    "snippet": "Donald Trump, six weeks into a historic comeback to the White House, on Tuesday heads to Capitol Hill to address Congress and the nation as a reinvented...",
    "date": "2 hours ago",
    "source": "ABC News"
  },
  {
    "link": "https://time.com/7263993/trump-address-congress/",
    "title": "Trump's Plan for Big Speech: Craft Viral Moments, Blame Biden",
    "snippet": "President Donald Trump outside the White House in Washington, D.C., on Feb. 27, 2025.Carl Court—Pool/Getty Images. Eric Cortellessa. by. Eric Cortellessa.",
    "date": "7 hours ago",
    "source": "Time Magazine"
  },
  {
    "link": "https://www.theguardian.com/us-news/2025/mar/04/watch-trump-state-union-address-time",
    "title": "What to know about Trump’s speech to Congress",
    "snippet": "Trump is set to lay out his agenda for second term in address at 9pm ET. Here's what to know about the speech and how to watch.",
    "date": "41 minutes ago",
    "source": "The Guardian"
  },
  {
    "link": "https://www.c-span.org/event/joint-session-of-congress/president-trump-addresses-joint-session-of-congress-democratic-response/431119",
    "title": "President Trump Addresses Joint Session of Congress & Democratic Response",
    "snippet": "President Trump delivers an address before a joint session of Congress, the first of his second term.",
    "date": "6 hours ago",
    "source": "C-SPAN"
  },
  {
    "link": "https://apnews.com/article/trump-speech-congress-musk-zelenskyy-3b7c80f39606911b9f12e732131fe7d1",
    "title": "Trump's speech to Congress comes as he wields vast power almost daring lawmakers, courts to stop him",
    "snippet": "WASHINGTON (AP) — President Donald Trump arrives this week on Capitol Hill to deliver a speech to Congress, a coequal branch of government he has bulldozed...",
    "date": "18 hours ago",
    "source": "AP News"
  },
  {
    "link": "https://www.cnn.com/politics/live-news/trump-administration-news-03-03-25/index.html",
    "title": "March 3, 2025: Donald Trump presidency news",
    "snippet": "The fallout from President Donald Trump's heated meeting with Ukrainian President Volodymyr Zelensky continues to reverberate from Washington to Kyiv ahead...",
    "date": "7 hours ago",
    "source": "CNN"
  },
  {
    "link": "https://www.nbcnews.com/politics/politics-news/live-blog/live-updates-trump-zelenskyy-ukraine-rcna194052",
    "title": "What to expect from Trump's joint speech to Congress as he faces backlash over Zelenskyy meeting",
    "snippet": "Ukrainian President Volodymyr Zelenskyy said yesterday that he believes he will be able to salvage his relationship with the United States after President...",
    "date": "9 hours ago",
    "source": "NBC News"
  },
  {
    "link": "https://www.npr.org/2025/03/04/g-s1-51748/trump-crypto-reserve-bitcoin-stockpile-ether",
    "title": "4 things to know about Trump's plan for a 'crypto strategic reserve'",
    "snippet": "President Trump has announced plans for a \"Crypto Strategic Reserve,\" which would set up the United States to buy and sell cryptocurrency and could be a...",
    "date": "4 hours ago",
    "source": "NPR"
  },
  {
    "link": "https://www.reuters.com/world/us/trump-says-federal-funding-will-stop-colleges-schools-allowing-illegal-protests-2025-03-04/",
    "title": "Trump says federal funding will stop for colleges, schools allowing 'illegal' protests",
    "snippet": "President Donald Trump said on Tuesday that all federal funding will stop for colleges and schools that allow \"illegal\" protests and that agitators will be...",
    "date": "1 hour ago",
    "source": "Reuters"
  },
  {
    "link": "https://www.aljazeera.com/news/2025/3/4/what-ukraine-military-aid-has-trump-paused-and-can-kyiv-fight-without-it",
    "title": "What Ukraine military aid has Trump paused, and can Kyiv fight without it?",
    "snippet": "United States President Donald Trump announced a pause on US military assistance to Ukraine on Monday, amid splintering relations with his Ukrainian...",
    "date": "1 hour ago",
    "source": "Al Jazeera"
  },
  {
    "link": "https://abcnews.go.com/Politics/trump-address-nation-amid-sagging-approval-ratings/story?id=119390771",
    "title": "Trump to address nation amid sagging approval ratings",
    "snippet": "President Donald Trump is set to address a joint session of Congress Tuesday night amid sinking approval ratings, according to recent polling data.",
    "date": "3 hours ago",
    "source": "ABC News"
  },
  {
    "link": "https://apnews.com/article/trump-zelenskyy-russia-ukraine-a15a459c9a3a393d040478ebbe250a9e",
    "title": "Trump pauses US military aid to Ukraine while pressuring Zelenskyy to move toward quick end to war",
    "snippet": "President Donald Trump slammed Ukrainian President Volodymyr Zelenskyy for suggesting that the end of Russia's war against Ukraine likely \"is still very,...",
    "date": "5 hours ago",
    "source": "AP News"
  },
  {
    "link": "https://www.reuters.com/world/reaction-trump-pausing-military-aid-ukraine-2025-03-04/",
    "title": "How officials are reacting to Trump pausing military aid to Ukraine",
    "snippet": "U.S. President Donald Trump has paused military aid to Ukraine following his clash with Ukrainian President Volodymyr Zelenskiy last week, a White House...",
    "date": "2 hours ago",
    "source": "Reuters"
  },
  {
    "link": "https://apnews.com/article/trump-tariffs-canada-mexico-china-643086a6dc7ff716d876b3c83e3255b0",
    "title": "US tariffs on Canada and Mexico take effect, as China takes aim at US farm exports",
    "snippet": "WASHINGTON (AP) — President Donald Trump's long-threatened tariffs against Canada and Mexico went into effect Tuesday, putting global markets on edge and...",
    "date": "59 minutes ago",
    "source": "AP News"
  },
  {
    "link": "https://www.theguardian.com/us-news/2025/mar/04/trump-state-of-the-union-address",
    "title": "Trump to lay out second-term vision in key address to Congress",
    "snippet": "President's first speech to joint session of Congress since reclaiming office comes after administration's radical start.",
    "date": "3 hours ago",
    "source": "The Guardian"
  },
  {
    "link": "https://www.npr.org/2025/03/03/nx-s1-5316899/trump-pauses-ukraine-military-aid",
    "title": "President Trump pauses Ukraine military aid",
    "snippet": "The news comes just days after a disastrous meeting between President Trump and Ukrainian President Volodymyr Zelenskyy.",
    "date": "12 hours ago",
    "source": "NPR"
  },
  {
    "link": "https://reproductivefreedomforall.org/news/media-resources-covering-donald-trumps-first-joint-address-to-congress/",
    "title": "MEDIA RESOURCES: Covering Donald Trump’s First Joint Address to Congress",
    "snippet": "MEDIA RESOURCES: Covering Donald Trump's First Joint Address to Congress. On Wednesday, President Donald Trump will give his first joint address to Congress...",
    "date": "16 hours ago",
    "source": "Reproductive Freedom for All"
  },
  {
    "link": "https://www.npr.org/2025/03/03/nx-s1-5316553/trump-tariffs-canada-mexico-china",
    "title": "Canada and China retaliate after Trump's tariffs take effect",
    "snippet": "Canada and China hit back swiftly after Trump's sweeping tariffs took effect Tuesday, raising fears of a global trade war. International markets, meanwhile...",
    "date": "6 hours ago",
    "source": "NPR"
  },
  {
    "link": "https://www.independent.co.uk/news/world/americas/us-politics/trump-news-tariffs-recession-stocks-canada-live-updates-b2708571.html",
    "title": "‘Trumpcession’ predicted to crash economy after new Trump tariffs hit markets: Live",
    "snippet": "President's trade aggression causes unease after he suspends American aid for Ukraine.",
    "date": "LIVE50 minutes ago",
    "source": "The Independent"
  },
  {
    "link": "https://abcnews.go.com/Politics/live-updates/trump-2nd-term-tariffs-ukraine/?id=119377651",
    "title": "Trump 2nd term live updates: US tariffs on Mexico, Canada, China take effect Tuesday",
    "snippet": "President Donald Trump on Monday directed his administration to \"pause\" military aid to Ukraine after the contentious meeting in the Oval Office with...",
    "date": "6 hours ago",
    "source": "ABC News"
  },
  {
    "link": "https://www.theguardian.com/us-news/live/2025/mar/04/donald-trump-congress-speech-ukraine-tariffs-democrats-federal-workers-us-politics-live-news",
    "title": "Major US retailers warn Americans will pay more because of Trump’s trade war with top partners, report says – live",
    "snippet": "CEOs of Best Buy and Target say shoppers are likely to see rising prices, CNBC reports, after Trump tariffs hit Canada, Mexico and China.",
    "date": "LIVE20 minutes ago",
    "source": "The Guardian"
  },
  {
    "link": "https://www.npr.org/2025/03/04/nx-s1-5294499/tariffs-trump-uncertainty-business",
    "title": "Tariffs have businesses bracing for change in Trump country",
    "snippet": "President Trump's tariff policy is creating uncertainty for places like Tupelo, Miss. with a manufacturing-dependent economy. It's in a conservative county...",
    "date": "3 hours ago",
    "source": "NPR"
  },
  {
    "link": "https://www.aljazeera.com/news/2025/3/4/trump-announces-us-crypto-reserve-what-it-is-and-why-it-matters",
    "title": "Trump announces US crypto reserve: What it is, and why it matters",
    "snippet": "The announcement over the weekend sent crypto markets into an upwards frenzy following a recent weeks-long slump.",
    "date": "5 hours ago",
    "source": "Al Jazeera"
  },
  {
    "link": "https://apnews.com/article/trump-congress-state-union-address-speech-8cfc36080ca688dfa0b0196323677fac",
    "title": "Trump's past speeches to Congress asked them to pass his agenda. Now, he's willing to go it alone",
    "snippet": "Judging by his past speeches to Congress, President Donald Trump once felt the need to ask lawmakers to pass his agenda. Not so much anymore.",
    "date": "1 day ago",
    "source": "AP News"
  },
  {
    "link": "https://www.cnn.com/2025/03/04/politics/what-to-watch-trump-congress/index.html",
    "title": "What to watch during Trump’s address to Congress",
    "snippet": "President Donald Trump's speech to a joint session of Congress on Tuesday night will act as an extension – and explanation – of the rapid change he's...",
    "date": "5 hours ago",
    "source": "CNN"
  },
  {
    "link": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-nasdaq-dow-futures-retreat-after-trump-delivers-his-tariff-salvoes-004521286.html",
    "title": "Stock market today: S&P 500, Nasdaq, Dow futures retreat after Trump delivers his tariff salvoes",
    "snippet": "Investors weighed Canada and China's response to President Donald Trump's delivery of new tariffs.",
    "date": "LIVE51 minutes ago",
    "source": "Yahoo Finance"
  },
  {
    "link": "https://www.reuters.com/technology/tsmc-ceo-meet-with-trump-tout-investment-plans-2025-03-03/",
    "title": "Trump and TSMC announce $100 billion plan to build five new US factories",
    "snippet": "Taiwan semiconductor company TSMC plans to make a fresh $100 billion investment in the United States that involves building five additional chip facilities...",
    "date": "7 hours ago",
    "source": "Reuters"
  },
  {
    "link": "https://www.reuters.com/world/us/donald-trump/trump-updates-latest-news-analysis-reaction-tariffs-ukraine-aid-pause-2025-03-04/",
    "title": "Trump Live: Ukraine military aid paused, US tariffs imposed on China, Canada and Mexico",
    "snippet": "China responded immediately to Trump's move, announcing additional tariffs of 10%-15% on certain U.S. imports from March 10 and a series of new export...",
    "date": "LIVE56 minutes ago",
    "source": "Reuters"
  },
  {
    "link": "https://www.npr.org/2025/03/04/nx-s1-5316258/president-trump-taking-an-ambitious-to-do-list-to-joint-session-of-congress-address",
    "title": "President Trump taking an ambitious to-do list to joint session of Congress address",
    "snippet": "President Trump heads to Capitol Hill Tuesday night to deliver an address to a joint session of Congress. He has an ambitious to-do list, but just a slim...",
    "date": "5 hours ago",
    "source": "NPR"
  },
  {
    "link": "https://apnews.com/article/trump-tariffs-mexico-canada-b19e004dddb579c373b247037e04424b",
    "title": "Trump says 25% tariffs on Mexican and Canadian imports will start Tuesday, with 'no room' for delay",
    "snippet": "President Donald Trump says 25% tariffs on imports from Mexico and Canada will start Tuesday, sparking renewed fears of a North American trade war.",
    "date": "11 hours ago",
    "source": "AP News"
  },
  {
    "link": "https://www.nbcnews.com/news/world/trump-ukraine-aid-russia-putin-zelenskyy-rcna194649",
    "title": "Trump’s pause on Ukraine aid is like the U.S. switching sides in WWII, expert says",
    "snippet": "Donald Trump's decision to pause American military aid to Ukraine's Volodymyr Zelenksyy is handing Russia's Vladimir Putin the upper hand, experts warn.",
    "date": "3 hours ago",
    "source": "NBC News"
  },
  {
    "link": "https://www.npr.org/2025/03/04/nx-s1-5314438/what-to-expect-from-president-trumps-address-to-a-joint-session-of-congress-tuesday",
    "title": "What to expect from President Trump's address to a joint session of Congress Tuesday",
    "snippet": "President Trump will give his first address to a joint session of Congress in his second term Tuesday night. So what can be expected?",
    "date": "5 hours ago",
    "source": "NPR"
  },
  {
    "link": "https://www.cnbc.com/2025/03/04/trumps-tariffs-start-global-trade-live-updates.html",
    "title": "Trump's tariffs start global trade fight as China, Canada retaliate: Live updates",
    "snippet": "President Donald Trump went forward with sweeping tariffs at midnight on goods imported from Canada and Mexico, while doubling down on punitive duties on...",
    "date": "LIVE27 minutes ago",
    "source": "CNBC"
  },
  {
    "link": "https://www.bloomberg.com/news/articles/2025-03-03/trump-pauses-military-aid-to-ukraine-after-clash-with-zelenskiy",
    "title": "Trump Pauses Military Aid to Ukraine After Clash With Zelenskiy",
    "snippet": "President Donald Trump ordered a pause to all US military aid to Ukraine, turning up the heat on Volodymyr Zelenskiy days after an Oval Office blowup with...",
    "date": "1 hour ago",
    "source": "Bloomberg.com"
  },
  {
    "link": "https://www.usatoday.com/story/news/politics/2025/03/04/trump-address-congress-amid-economy-concerns/81148541007/",
    "title": "Donald Trump to address Congress amid growing pessimism about the economy",
    "snippet": "As he gives his first joint address to Congress, President Trump will face a nation turning skeptical about his handling of the economy and inflation.",
    "date": "4 hours ago",
    "source": "USA Today"
  },
  {
    "link": "https://www.nbcnews.com/politics/congress/trump-behind-the-scenes-approach-republicans-congress-rcna194054",
    "title": "Trump trades public attacks for a behind-the-scenes approach to influence Congress",
    "snippet": "Trump's friendlier approach to dealing with Republican lawmakers is a stark departure from his first term, when he often took his critics to task on social...",
    "date": "4 hours ago",
    "source": "NBC News"
  },
  {
    "link": "https://www.nytimes.com/2025/03/04/us/politics/trump-speech-congress-when-time-watch.html",
    "title": "Here’s How to Watch Trump’s Address to Congress",
    "snippet": "President Trump will address the joint session of Congress on Tuesday night at 9 p.m., expected to lay out his aggressive agenda for remaking the federal...",
    "date": "4 hours ago",
    "source": "The New York Times"
  },
  {
    "link": "https://www.npr.org/2025/03/04/g-s1-51799/trump-corporate-bribery-investigations",
    "title": "Trump agencies drop dozens of Biden-era cases against crypto, other companies",
    "snippet": "A new watchdog report warns that the Trump administration is \"going soft\" on corporations that break the law by moving to pause or drop investigations of...",
    "date": "4 hours ago",
    "source": "NPR"
  },
  {
    "link": "https://apnews.com/live/donald-trump-address-congress-updates",
    "title": "Live updates: Trump’s long-threatened tariffs against Canada and Mexico go into effect",
    "snippet": "President Donald Trump's long-threatened tariffs against Canada and Mexico went into effect Tuesday, putting global markets on edge and setting up costly...",
    "date": "LIVE12 minutes ago",
    "source": "AP News"
  },
  {
    "link": "https://www.cfr.org/blog/donald-trump-makes-his-case-joint-session-congress",
    "title": "Donald Trump Makes His Case to a Joint Session of Congress",
    "snippet": "President Donald Trump is set to address a joint session of Congress tomorrow night at 9 p.m. E.S.T. The speech is his opportunity to make the case to the...",
    "date": "18 hours ago",
    "source": "Council on Foreign Relations"
  },
  {
    "link": "https://abcnews.go.com/Politics/watch-stream-trumps-address-joint-session-congress/story?id=119226081",
    "title": "How to watch, stream Trump's address to the joint session of Congress",
    "snippet": "President Donald Trump is set to address a joint session of Congress on Tuesday -- his first speech to Congress of his second term.",
    "date": "6 hours ago",
    "source": "ABC News"
  },
  {
    "link": "https://www.nytimes.com/2025/03/04/world/europe/trump-ukraine-aid.html",
    "title": "Why Is Trump Pausing Aid to Ukraine? What to Know.",
    "snippet": "The decision marked the realization of a fear that has racked Ukraine since President Trump's re-election.",
    "date": "2 hours ago",
    "source": "The New York Times"
  },
  {
    "link": "https://www.nytimes.com/2025/03/04/briefing/donald-trump-tariffs-canada-mexico-china.html",
    "title": "Trump’s Tariffs Against China, Canada and Mexico",
    "snippet": "President Trump's tariffs on Canada, Mexico and China took effect at midnight. By now, you've probably heard about the risks: higher prices, slower economic...",
    "date": "2 hours ago",
    "source": "The New York Times"
  },
  {
    "link": "https://abcnews.go.com/Business/trump-tariffs-effect-canada-mexico-china-retaliates/story?id=119417925",
    "title": "Historic Trump tariffs go into effect against Canada, Mexico; China retaliates",
    "snippet": "President Donald Trump's broad tariffs on imported goods from Mexico and Canada went into effect on Tuesday, along with increased duties on goods from...",
    "date": "3 hours ago",
    "source": "ABC News"
  },
  {
    "link": "https://www.bbc.com/news/articles/c89ye749nxvo",
    "title": "Canada hits back at US tariffs after warning of 'existential threat'",
    "snippet": "Ottawa targets its neighbour with import taxes after President Trump imposed new levies on his top trade partners.",
    "date": "3 hours ago",
    "source": "BBC"
  },
  {
    "link": "https://www.economist.com/interactive/trump-approval-tracker/hundred-days",
    "title": "Donald Trump’s executive orders, cabinet picks and policies: tracking the first 100 days",
    "snippet": "On this page we are tracking ten of the pledges Mr Trump has repeated most often. Follow the cards below, which we'll update as the president makes some, or...",
    "date": "5 hours ago",
    "source": "The Economist"
  },
  {
    "link": "https://www.cbsnews.com/news/how-watch-trump-speech-address-congress-2025/",
    "title": "How to watch Trump's speech for his 2025 joint address to Congress",
    "snippet": "President Trump will address a joint session of Congress tonight, marking his first speech to both chambers since he returned to office. Here's how to watch...",
    "date": "4 hours ago",
    "source": "CBS News"
  },
  {
    "link": "https://www.france24.com/en/live-news/20250304-trump-to-pledge-new-american-dream-in-congress-speech",
    "title": "Trump to pledge new 'American dream' in Congress speech",
    "snippet": "Donald Trump will promise a \"renewal of the American dream\" on Tuesday in his first address to Congress since returning to office, laying out a vision of...",
    "date": "8 hours ago",
    "source": "France 24"
  },
  {
    "link": "https://www.post-gazette.com/opinion/adriana-e-ramirez/2025/03/03/ramirez-political-identity-progressives-conservatives-undecided/stories/202503040010",
    "title": "Adriana E. Ramírez: Progressives should admit that Donald Trump might do something right",
    "snippet": "It didn't used to be like this — or maybe it always has been and I simply don't remember: When did our political parties become our identities?",
    "date": "19 hours ago",
    "source": "Pittsburgh Post-Gazette"
  },
  {
    "link": "https://www.ft.com/content/7f794cf9-ed9d-408a-8925-806896a3f58d",
    "title": "Stocks fall as Donald Trump imposes tariffs on top US trade partners",
    "snippet": "Donald Trump has imposed a swath of tariffs on Canada, Mexico and China, sparking retaliation from Beijing and sending stock markets lower as fears mount...",
    "date": "5 hours ago",
    "source": "Financial Times"
  },
  {
    "link": "https://www.bbc.com/news/articles/cwydq82e7r1o",
    "title": "'This is a catastrophe': Ukraine reacts to US military aid pause",
    "snippet": "One Ukrainian politician urged Trump \"not to play with these dangerous issues because we're talking about lives\".",
    "date": "1 hour ago",
    "source": "BBC"
  },
  {
    "link": "https://www.nbcnews.com/politics/donald-trump/trump-orders-pause-military-aid-ukraine-wake-last-weeks-oval-office-cl-rcna194627",
    "title": "Trump orders pause on military aid to Ukraine in the wake of Oval Office clash with Zelenskyy",
    "snippet": "The move comes as Trump ramps up his attacks on President Volodymyr Zelenskyy and U.S. financial support for Ukraine's war against Russia.",
    "date": "13 hours ago",
    "source": "NBC News"
  },
  {
    "link": "https://www.nbcnews.com/news/us-news/trump-turns-russia-breaking-decades-us-policy-rcna194518",
    "title": "Trump turns toward Russia, breaking with decades of U.S. policy",
    "snippet": "The extraordinary pivot is upending decades of hawkish foreign policy, raising questions about the future of post-World War II global security project.",
    "date": "18 hours ago",
    "source": "NBC News"
  },
  {
    "link": "https://www.cnn.com/2025/03/03/politics/video/trump-zelensky-ukraine-military-aid-russia-putin-zeleny-liebermann-ebof-digvid",
    "title": "Jeff Zeleny calls Trump pause of military aid to Ukraine a ‘deep blow’",
    "snippet": "President Donald Trump is ordering military aid to Ukraine to be paused after his Oval Office spat with Ukraine's President Volodymyr Zelensky,...",
    "date": "13 hours ago",
    "source": "CNN"
  },
  {
    "link": "https://www.washingtonpost.com/politics/2025/03/04/arizona-trump-michael-mccune-ukraine/",
    "title": "How an Arizona DJ and karate instructor won Trump’s ear on Ukraine",
    "snippet": "Until President Donald Trump quoted Michael McCune's Facebook post, it wasn't clear whether he remained interested in pursuing a minerals deal with Ukraine.",
    "date": "28 minutes ago",
    "source": "The Washington Post"
  },
  {
    "link": "https://www.bbc.com/news/articles/cn48q3150dxo",
    "title": "Stock markets sink as Trump confirms tariffs on Canada, Mexico and China",
    "snippet": "The US president has repeatedly threatened to tax imports from two of the country's closest neighbours.",
    "date": "10 hours ago",
    "source": "BBC"
  },
  {
    "link": "https://finance.yahoo.com/news/live/live-trump-tariffs-take-effect-on-canada-mexico-after-trump-says-no-room-left-for-delay-191201251.html",
    "title": "Live: Trump tariffs take effect on Canada, Mexico after Trump says 'no room left' for delay",
    "snippet": "US President Donald Trump is reshaping the country's trade policy using one of his preferred economic tools: tariffs. Here's where things stand with various...",
    "date": "7 hours ago",
    "source": "Yahoo Finance"
  },
  {
    "link": "https://time.com/7264148/ukraine-trump-aid-pause-reactions-russia-war-zelensky/",
    "title": "Ukrainians React to Trump’s Pause on Aid",
    "snippet": "Kyiv has feared the possibility of the U.S. stopping military aid for the fight against Russia's invasion ever since Trump took office.",
    "date": "4 hours ago",
    "source": "Time Magazine"
  },
  {
    "link": "https://www.nbcnews.com/data-graphics/trump-tariffs-china-mexico-canada-trade-charts-rcna194564",
    "title": "Trump's tariff threats against China, Mexico and Canada, in five charts",
    "snippet": "President Donald Trump's repeated threats to dramatically expand tariffs are now a reality. Tariffs of 25% on goods from Mexico and Canada went into effect...",
    "date": "2 hours ago",
    "source": "NBC News"
  },
  {
    "link": "https://abcnews.go.com/Politics/backdrop-trumps-speech-congress-potential-government-shutdown/story?id=119391589",
    "title": "Backdrop for Trump's speech to Congress is a potential government shutdown",
    "snippet": "A potential government shutdown looms large as President Donald Trump addresses a joint session of Congress on Tuesday night -- where he's sure to face a...",
    "date": "2 hours ago",
    "source": "ABC News"
  },
  {
    "link": "https://time.com/7264098/trump-speech-not-state-of-the-union-history-inauguration-year-address-congress/",
    "title": "Why Trump’s Speech Technically Isn’t a State of the Union Address",
    "snippet": "President Donald Trump speaks at the White House in Washington, D.C., on March 3, 2025.Roberto Schmidt—AFP/Getty Images. Chad de Guzman.",
    "date": "8 hours ago",
    "source": "Time Magazine"
  },
  {
    "link": "https://www.usatoday.com/story/news/politics/2025/03/04/trump-mexico-canada-china-united-states-tariffs/81294660007/",
    "title": "'We'll fight to the bitter end': China and Canada retaliate against new Trump tariffs",
    "snippet": "President Donald Trump's tariff actions, which could upend nearly $2.2 trillion in two-way annual U.S. trade, went live on Tuesday.",
    "date": "3 hours ago",
    "source": "USA Today"
  },
  {
    "link": "https://6abc.com/post/donald-trumps-tariffs-canada-mexico-now-effect-kicking-off-trade-war/15975230/",
    "title": "Donald Trump's tariffs against Canada and Mexico now in effect, kicking off trade war",
    "snippet": "Donald Trump's tariffs against Canada and Mexico went into effect, putting markets on edge and setting up retaliations by the United States' allies.",
    "date": "8 hours ago",
    "source": "6abc Philadelphia"
  },
  {
    "link": "https://www.cnn.com/2025/03/04/us/5-things-to-know-for-march-4/index.html",
    "title": "5 things to know for March 4: Trump tariffs, Ukraine aid suspended, storm threat, crypto reserve, SpaceX launch scrubbed",
    "snippet": "President Donald Trump will soon head to Capitol Hill for perhaps the most consequential speech of his second term so far. He is set to deliver an address...",
    "date": "3 hours ago",
    "source": "CNN"
  },
  {
    "link": "https://www.ft.com/content/1b098f25-be3b-406d-88ad-569a03aa3cd1",
    "title": "Why Volodymyr Zelenskyy refuses Donald Trump’s ceasefire ‘trap’",
    "snippet": "The White House bust-up between Donald Trump and Volodymyr Zelenskyy — leading to a US decision to suspend military aid to Ukraine — was triggered by an...",
    "date": "5 hours ago",
    "source": "Financial Times"
  },
  {
    "link": "https://www.bbc.com/news/articles/cyvejezz71zo",
    "title": "Trump tariffs could be good for some countries, including the UK",
    "snippet": "Donald Trump's tariffs on Canada, Mexico and China have turned back the clock 70 years, erasing decades of globalisation.",
    "date": "1 hour ago",
    "source": "BBC"
  },
  {
    "link": "https://www.reuters.com/markets/investors-say-its-time-take-trump-seriously-markets-recoil-2025-03-04/",
    "title": "Investors say it's time to take Trump seriously as markets recoil",
    "snippet": "Markets no longer think Donald Trump is full of bluster and are moving quickly to anticipate a slowdown in U.S. and global growth as he raises a wall of...",
    "date": "3 hours ago",
    "source": "Reuters"
  },
  {
    "link": "https://slate.com/life/2025/03/donald-trump-divorce-marriage-politics-men-women.html",
    "title": "This Fall, I Followed Three Women Who Wanted to Divorce Their Husbands Over Politics. Then Trump Won Again.",
    "snippet": "Marriage is hardly a new invention. But leaving your husband is, relatively speaking. There's one political party in particular that isn't so happy with...",
    "date": "3 hours ago",
    "source": "Slate"
  },
  {
    "link": "https://www.washingtonpost.com/the-seven-trump/2025/03/03/tracking-trump-actions-tariffs-canada-mexico-ukraine-russia-relations/",
    "title": "Tracking Trump: Tariff threats send stocks tumbling; fallout from the Trump-Zelensky meeting; and more",
    "snippet": "The 7 follows President Donald Trump's first 100 days.",
    "date": "7 hours ago",
    "source": "The Washington Post"
  },
  {
    "link": "https://www.reuters.com/world/us/trump-tariffs-arrive-companies-brace-more-uncertainty-2025-03-04/",
    "title": "As Trump tariffs arrive, companies brace for more uncertainty",
    "snippet": "Business executives have been in a state of limbo over Donald Trump's fluctuating plans to impose major tariffs since he took office in January.",
    "date": "8 hours ago",
    "source": "Reuters"
  },
  {
    "link": "https://www.cnn.com/2025/03/03/politics/trump-administration-ukraine-aid/index.html",
    "title": "Trump pauses military aid to Ukraine after Oval Office argument with Zelensky, White House official says",
    "snippet": "President Donald Trump is ordering a pause on shipments of US military aid to Ukraine after his heated Oval Office argument with Ukrainian President...",
    "date": "11 hours ago",
    "source": "CNN"
  },
  {
    "link": "https://www.kuer.org/politics-government/2025-03-04/watch-live-video-president-donald-trump-2025-joint-session-congress",
    "title": "WATCH LIVE: President Trump’s 2nd term address to a joint session of Congress",
    "snippet": "President Donald Trump will address Congress on Tuesday, March 4, 2025, at 9 p.m. ET / 7 p.m. MT.",
    "date": "7 hours ago",
    "source": "KUER"
  },
  {
    "link": "https://www.nbcwashington.com/news/local/dc-officers-pardoned-by-president-trump-reinstated/3857594/",
    "title": "DC officers pardoned by President Trump reinstated",
    "snippet": "The two D.C. officers convicted in the Oct. 2020 death of Karon Hylton-Brown have been reinstated, according to the Metropolitan Police Department.",
    "date": "10 hours ago",
    "source": "NBC4 Washington"
  },
  {
    "link": "https://www.bbc.com/news/articles/cn93e12rypgo",
    "title": "What are tariffs, why is Trump using them, and will prices rise?",
    "snippet": "President Donald Trump has said that starting on Tuesday, the US will impose 25% tariffs on Mexico and Canada and will double the tax recently put on goods...",
    "date": "16 hours ago",
    "source": "BBC"
  },
  {
    "link": "https://www.cnn.com/2025/03/03/politics/speech-congress-trump-agenda/index.html",
    "title": "Trump’s speech to Congress will be an explanation of his fast-paced first days in office",
    "snippet": "The last time President Donald Trump climbed the rostrum in the House chamber to deliver an address to Congress, he arrived freshly impeached, a mysterious...",
    "date": "14 hours ago",
    "source": "CNN"
  },
  {
    "link": "https://www.fool.com/investing/2025/03/04/stock-market-soar-or-crash-president-donald-trump/",
    "title": "Will the Stock Market Soar or Crash Under President Donald Trump? History Offers an Answer.",
    "snippet": "The U.S. stock market has declined about a percentage point since President Donald Trump started his second term in January 2025.",
    "date": "5 hours ago",
    "source": "The Motley Fool"
  },
  {
    "link": "https://www.aljazeera.com/news/2025/3/4/trump-pauses-military-aid-to-ukraine-after-bust-up-with-zelenskyy-reports",
    "title": "Trump pauses military aid to Ukraine after bust-up with Zelenskyy",
    "snippet": "United States President Donald Trump has paused military aid to Ukraine in a dramatic escalation of his spat with Ukrainian President Volodymyr Zelenskyy.",
    "date": "10 hours ago",
    "source": "Al Jazeera"
  },
  {
    "link": "https://www.aljazeera.com/program/newsfeed/2025/3/4/trump-confirms-new-tariffs-on-canada-mexico-and-china",
    "title": "Trump confirms new tariffs on Canada, Mexico and China",
    "snippet": "New US tariffs are in force against Canada, Mexico and China after President Donald Trump confirmed they would go ahead.",
    "date": "5 hours ago",
    "source": "Al Jazeera"
  },
  {
    "link": "https://www.politico.com/news/2025/03/04/7-things-trump-joint-address-congress-00209818",
    "title": "7 things to watch for during Trump’s joint address to Congress",
    "snippet": "President Donald Trump shocked the nation eight years ago when his first joint address to Congress was, well, presidential. There was none of what the...",
    "date": "4 hours ago",
    "source": "Politico"
  },
  {
    "link": "https://www.nbcnews.com/tech/crypto/trump-proposal-create-crypto-strategic-reserve-vexes-industry-supporte-rcna194478",
    "title": "Trump proposal to create 'crypto strategic reserve' vexes some industry supporters",
    "snippet": "President Donald Trump said Sunday that he is directing his newly created digital assets working group to move forward on creating a “crypto strategic...",
    "date": "15 hours ago",
    "source": "NBC News"
  },
  {
    "link": "https://www.theguardian.com/us-news/2025/mar/04/president-trump-administration-news-updates-today",
    "title": "Trump administration briefing: Vance defends US position on Ukraine; tariffs hit Canada, Mexico and China",
    "snippet": "China and Canada retaliate after tariffs come into effect – key US politics stories from Monday at a glance.",
    "date": "7 hours ago",
    "source": "The Guardian"
  },
  {
    "link": "https://www.washingtonpost.com/politics/2025/03/03/trump-presidency-news/",
    "title": "Trump administration to pause deliveries of military assistance to Ukraine, officials say",
    "snippet": "The latest news on President Donald Trump's return to the White House and the new Congress.",
    "date": "10 hours ago",
    "source": "The Washington Post"
  },
  {
    "link": "https://www.npr.org/2025/03/03/nx-s1-5316162/trump-tariffs-canada-mexico-cars-auto-industry",
    "title": "Auto industry braces for a blow from 25% tariffs on Canada and Mexico",
    "snippet": "As President Trump's once-postponed 25% tariffs on Canada and Mexico are poised to transition from a threat to a reality, the auto industry is preparing for...",
    "date": "14 hours ago",
    "source": "NPR"
  },
  {
    "link": "https://www.cnn.com/2025/03/03/politics/trump-tariffs-economy-gamble/index.html",
    "title": "Trump makes fateful wager by testing his lifelong faith in the power of tariffs",
    "snippet": "Donald Trump just took the biggest gamble of his young second presidency.",
    "date": "9 hours ago",
    "source": "CNN"
  },
  {
    "link": "https://www.cnn.com/2025/03/04/economy/trade-mexico-canada-china-tariffs-trump-hnk-intl/index.html",
    "title": "US tariffs on Mexico, Canada and China take effect, opening door to painful trade war",
    "snippet": "President Donald Trump's blanket 25% tariffs on Mexico and Canada took effect on Tuesday, an extraordinary action aimed at bringing America's top trading...",
    "date": "3 hours ago",
    "source": "CNN"
  },
  {
    "link": "https://www.pbs.org/newshour/show/what-americans-think-about-trumps-second-term-so-far",
    "title": "What Americans think about Trump’s second term so far",
    "snippet": "As President Trump gets ready to address Congress for the first time since reentering the Oval Office, our latest PBS News/NPR/Marist poll offers a new look...",
    "date": "14 hours ago",
    "source": "PBS"
  },
  {
    "link": "https://apnews.com/article/trump-tsmc-chip-manufacturing-tariffs-42980704ffca62e823182422ee4b7b83",
    "title": "Giant chipmaker TSMC to spend $100B to expand chip manufacturing in US, Trump announces",
    "snippet": "Chip giant Taiwan Semiconductor Manufacturing Co. plans to invest an additional $100 billion in the United States, President Donald Trump announced Monday...",
    "date": "15 hours ago",
    "source": "AP News"
  },
  {
    "link": "https://www.bbc.com/news/articles/crrd7gpvw5po",
    "title": "Trump's tariffs risk economic turmoil - and voter backlash",
    "snippet": "Donald Trump has been threatening major tariffs on America's two largest trading partners, Canada and Mexico, for more than a month. It now appears that the...",
    "date": "11 hours ago",
    "source": "BBC"
  },
  {
    "link": "https://www.bbc.com/news/live/cvgpdk4257zt",
    "title": "Trump tariffs live updates: US tariffs prompt retaliation from China and Canada as Mexico expected to respond",
    "snippet": "Donald Trump's 25% tariffs on imports from Canada and Mexico have begun, as has a new 10% levy against China - what tariffs are and why the US president's...",
    "date": "12 hours ago",
    "source": "BBC"
  },
  {
    "link": "https://thehill.com/newsletters/morning-report/5174503-donald-trump-disruptive-government-speech/",
    "title": "Morning Report — Trump to sell disruptive governance in speech",
    "snippet": "In today's issue: President Trump will tell Americans in a prime-time speech tonight that his dizzying moves early in his second term should give them...",
    "date": "3 hours ago",
    "source": "The Hill"
  },
  {
    "link": "https://www.axios.com/2025/03/04/trump-russia-ukraine-policy-pro-putin",
    "title": "Trump's stunning string of Putin-friendly moves",
    "snippet": "President Trump's decision to suspend all military aid to Ukraine is the latest in a string of moves that could have been plucked from Vladimir Putin's...",
    "date": "4 hours ago",
    "source": "Axios"
  },
  {
    "link": "https://apnews.com/article/trump-crypto-bitcoin-digital-assets-reserve-2f4246434a657f248cd85296f14382f9",
    "title": "Trump sends crypto prices on a short-lived surge after announcement of strategic government reserve",
    "snippet": "Cryptocurrency prices briefly jumped after President Donald Trump's surprise announcement he wants the U.S. government to purchase and hold a variety of...",
    "date": "16 hours ago",
    "source": "AP News"
  },
  {
    "link": "https://www.wbaltv.com/article/trump-congress-speech-2025/64028723",
    "title": "What to watch for as President Trump gives speech to Congress",
    "snippet": "President Donald Trump is preparing for his first big speech to Congress since returning to the White House.",
    "date": "4 hours ago",
    "source": "WBAL-TV"
  },
  {
    "link": "https://apnews.com/live/donald-trump-news-updates-3-3-2025",
    "title": "Trump orders a ‘pause’ of US military aid for Ukraine",
    "snippet": "President Donald Trump is seeking to pressure Ukrainian President Volodymyr Zelenskyy to engage in peace talks with Russia by pausing military aid to...",
    "date": "13 hours ago",
    "source": "AP News"
  }
]